In [1]:
import numpy as np
import pandas as pd

### Creating a DataFrame

In [96]:
data = {
    'Name': ['Rupesh','Rohan','Sahil','Ravi'],
    'Age': [23,42,23,35],
    'City': ['Hajipur', 'Patna', 'Noida', 'Sitamarhi'],
    'Salary': [25000, 70000, 62000, 85000]
}
df1=pd.DataFrame(data)
df1

     Name  Age       City  Salary
0  Rupesh   23    Hajipur   25000
1   Rohan   42      Patna   70000
2   Sahil   23      Noida   62000
3    Ravi   35  Sitamarhi   85000

In [97]:
data_list = [
    ['Sonal',28,'Jandaha',62000],
    ['Abhi',38,'Arniya',72000],
    ['Raushan',42,'Salha',63000],
    ['Sonal',58,'Pirapur',92000],
]
columns = ['Name', 'Age', 'City', 'Salary']

In [98]:
df2=pd.DataFrame(data_list, columns=columns)
df2

      Name  Age     City  Salary
0    Sonal   28  Jandaha   62000
1     Abhi   38   Arniya   72000
2  Raushan   42    Salha   63000
3    Sonal   58  Pirapur   92000

### Selection and Indexing of column

In [99]:
df2['Name']

0      Sonal
1       Abhi
2    Raushan
3      Sonal
Name: Name, dtype: str

In [100]:
df2['City']

0    Jandaha
1     Arniya
2      Salha
3    Pirapur
Name: City, dtype: str

In [101]:
df1[['Name','City']]

     Name       City
0  Rupesh    Hajipur
1   Rohan      Patna
2   Sahil      Noida
3    Ravi  Sitamarhi

### Creating a new column

In [102]:
df2['Designation']= ["Doctor","Eng","Doctor","Eng"]

In [103]:
df2

      Name  Age     City  Salary Designation
0    Sonal   28  Jandaha   62000      Doctor
1     Abhi   38   Arniya   72000         Eng
2  Raushan   42    Salha   63000      Doctor
3    Sonal   58  Pirapur   92000         Eng

### Removing Column

In [104]:
df2

      Name  Age     City  Salary Designation
0    Sonal   28  Jandaha   62000      Doctor
1     Abhi   38   Arniya   72000         Eng
2  Raushan   42    Salha   63000      Doctor
3    Sonal   58  Pirapur   92000         Eng

In [105]:
df2.drop('Designation', axis=1)

      Name  Age     City  Salary
0    Sonal   28  Jandaha   62000
1     Abhi   38   Arniya   72000
2  Raushan   42    Salha   63000
3    Sonal   58  Pirapur   92000

In [106]:
df2

      Name  Age     City  Salary Designation
0    Sonal   28  Jandaha   62000      Doctor
1     Abhi   38   Arniya   72000         Eng
2  Raushan   42    Salha   63000      Doctor
3    Sonal   58  Pirapur   92000         Eng

In [108]:
df2.drop('Designation', axis=1, inplace=True)

In [109]:
df2

      Name  Age     City  Salary
0    Sonal   28  Jandaha   62000
1     Abhi   38   Arniya   72000
2  Raushan   42    Salha   63000
3    Sonal   58  Pirapur   92000

In [110]:
df2.drop(['Name', 'City'], axis=1, inplace=True)

In [111]:
df2

   Age  Salary
0   28   62000
1   38   72000
2   42   63000
3   58   92000

In [112]:
df2.drop(2, axis=0)

   Age  Salary
0   28   62000
1   38   72000
3   58   92000

### Selecting Rows

In [113]:
df1

     Name  Age       City  Salary
0  Rupesh   23    Hajipur   25000
1   Rohan   42      Patna   70000
2   Sahil   23      Noida   62000
3    Ravi   35  Sitamarhi   85000

In [115]:
df1.loc[0]

Name       Rupesh
Age            23
City      Hajipur
Salary      25000
Name: 0, dtype: object

In [116]:
df1.loc[[0,1]]

     Name  Age     City  Salary
0  Rupesh   23  Hajipur   25000
1   Rohan   42    Patna   70000

In [117]:
df1.iloc[0]

Name       Rupesh
Age            23
City      Hajipur
Salary      25000
Name: 0, dtype: object

In [119]:
df1.iloc[[0,3]]

     Name  Age       City  Salary
0  Rupesh   23    Hajipur   25000
3    Ravi   35  Sitamarhi   85000

### Selecting Subsets of rows and columns

In [120]:
df1

     Name  Age       City  Salary
0  Rupesh   23    Hajipur   25000
1   Rohan   42      Patna   70000
2   Sahil   23      Noida   62000
3    Ravi   35  Sitamarhi   85000

In [121]:
df1.iloc[[0,1]][['City', 'Salary']]

      City  Salary
0  Hajipur   25000
1    Patna   70000

### Conditional Selection

In [122]:
df1

     Name  Age       City  Salary
0  Rupesh   23    Hajipur   25000
1   Rohan   42      Patna   70000
2   Sahil   23      Noida   62000
3    Ravi   35  Sitamarhi   85000

In [123]:
df1[df1["Age"]> 30]

    Name  Age       City  Salary
1  Rohan   42      Patna   70000
3   Ravi   35  Sitamarhi   85000

In [124]:
df1[(df1["Age"] > 30) & (df1['City'] != "Patna")]

   Name  Age       City  Salary
3  Ravi   35  Sitamarhi   85000

In [125]:
df1[(df1["Age"] > 30) & (df1['City'] == "patna")]

Empty DataFrame
Columns: [Name, Age, City, Salary]
Index: []

In [126]:
df1[(df1["Age"] > 30) & (df1['City'] == "Patna")]

    Name  Age   City  Salary
1  Rohan   42  Patna   70000